import {
  IsEmail,
  IsNotEmpty,
  IsOptional,
  Length,
  Matches,
} from 'class-validator';

//Класс DTO для регистрации
export class DtoForReg {
  //Проверка на полноту заполнения, на длину и шаблон строки
  @IsNotEmpty({ message: 'Поле username не должно быть пустым' })
  @Length(4, 15, {
    message:
      'Вы ввели не корректный username. Username должен содержать от 4 до 15 символов.',
  })
  @Matches(/^[0-9a-zA-Z]+$/, {
    message:
      'Username должен содержать только буквы латинского алфавита и цифры.',
  })
  username: string;

  //Проверка на полноту заполнения, и на соответствие строки имайлу
  @IsNotEmpty({ message: 'Поле email не должно быть пустым' })
  @IsEmail({}, { message: 'Вы ввели не корректный email.' })
  email: string;

  //Если строка не пустая проверка на длину и шаблон строки
  @IsOptional()
  @Length(11, 11, {
    message:
      'Вы ввели не корректный номер телефона. Номер телефона состоит из 11 цифр.',
  })
  @Matches(/^8[0-9]+$/, {
    message: 'Номер телефона должен содержать только цифры.',
  })
  phone_number?: string;

  //Проверка на полноту заполнения, длину и шаблон строки
  @IsNotEmpty({ message: 'Поле password не должно быть пустым' })
  @Length(8, 16, {
    message:
      'Вы ввели не корректный пароль. Пароль должен содержать от 8 до 16 символов.',
  })
  @Matches(/^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])([a-zA-Z0-9])+$/, {
    message:
      'Пароль должен состоять хотя-бы из одной цифры, заглавной и прописной буквы. И содержать только буквы латинского алфавита и цифры.',
  })
  password: string;

  is2Fa: boolean;
}
